app/controllers/users_controller.rb

   def register
    user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Lorraine"], ["email", "lorr@mail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-22 08:30:52.012349"], ["updated_at", "2023-03-22 08:30:52.012349"]]